In [9]:
#usuage of melt function in pandas
import pandas as pd
var1=pd.DataFrame({'name': ['John', 'Alice', 'Bob'], 'age': [1,2,3]})
var1

    name  age
0   John    1
1  Alice    2
2    Bob    3

In [8]:
var1.melt("name")

    name variable  value
0   John      age      1
1  Alice      age      2
2    Bob      age      3

In [12]:
#usuage of pivot_table function in pandas
var1.pivot_table(index='name', values='age')

       age
name
Alice  2.0
Bob    3.0
John   1.0